#+TITLE: Land of Lisp
#+TAGS: cannot beyond important
#+STARTUP: overview
**** defparameter は値を上書きする
#+BEGIN_SRC lisp
(defparameter *foo* 5)
(defparameter *foo* 200)
*foo*
#+END_SRC

#+RESULTS:
: 200

[[/Users/ahayashi/Documents/GitHub/study/Programing/land_of_lisp/code/guess.lisp][コード]]



**** defvar は値を上書きしない
#+BEGIN_SRC lisp
  (defvar *bar* 5)
  (defvar *bar* 200)
   *bar*
#+END_SRC

#+RESULTS:
: 5
***** 関数を使ってみる
#+BEGIN_SRC lisp
(guess-my-number)
#+END_SRC

#+RESULTS:
: 50
下限1，上限100の中間，50 が返っている．
表示までしてしまうのは lisp の仕様．
***** 使ってみる
#+BEGIN_SRC lisp
(guess-my-number)
#+END_SRC

#+RESULTS:
: 100
値が増えたまま，戻らなくなってしまった
*** ローカル変数を定義する let
ここまでは，グローバル変数とグローバル関数を定義した．
でも，定義を一つの関数や，一つのコードブロック内だけで有効にしたいということはよくある．
#+BEGIN_SRC lisp
  (let ((a 5)
        (b 6))
    (+ a b))
#+END_SRC

#+RESULTS:
: 11

**** やってみる
#+BEGIN_SRC lisp
  (flet ((f (n)
           (+ n 10)))
    (f 5))
#+END_SRC

#+RESULTS:
: 15

**** 一気に2つ定義してみる
#+BEGIN_SRC lisp
  (flet ((f (n)
           (+ n 10))
         (g (n)
           (- n 3)))
    (g (f 5)))
#+END_SRC

#+RESULTS:
: 12

**** ローカル関数の中で，作ったばかりのローカル関数を使う labels
#+BEGIN_SRC lisp
  (labels ((a (n)
             (+ n 5))
           (b (n)
             (+ (a n) 6)))
    (b 10))                               ; 関数a は 関数b に含まれているので，最後は関数b だけが呼ばれている
#+END_SRC

#+RESULTS:
: 21
labels を使えば，定義の中で自分自身を呼ぶこともできる（再帰）．
**** 普通に作ると名前が必要
#+BEGIN_SRC elisp
  (defun half (n)
    (/ n 2))

  (half 6)
#+END_SRC

#+RESULTS:
: 3
**** lambdaを使うと名前もdefunもいらない
#+BEGIN_SRC elisp
  ((lambda (n) (/ n 2)) 10)
#+END_SRC

#+RESULTS:
: 4
**** mapcarに渡して使う
#+BEGIN_SRC elisp
  (mapcar (lambda (n) (/ n 2)) '(2 4 6))
#+END_SRC

#+RESULTS:
| 1 | 2 | 3 |
***** 不正なページへリクエストを出してみる
#+BEGIN_SRC lisp
(hello-request-handler "lolcats" '() '())
#+END_SRC

#+RESULTS:
: Sorry... I don't know that page.
***** 正しいページへリクエストを出してみる
#+BEGIN_SRC lisp :results output
(hello-request-handler "greeting" '() '())
#+END_SRC

#+RESULTS:
: <form>What is your name?<input name='name' /></form>
素晴らしい．
***** 名前を渡してもう一度
#+BEGIN_SRC lisp :results output
(hello-request-handler "greeting" '() '((name . "Bob")))
#+END_SRC

#+RESULTS:
: Nice to meet you, Bob!
******* 関数を使ってみる
長さが3のリストを渡すと，ちゃんと3と返ってきた．

#+BEGIN_SRC elisp
  (my-length '(fie foh fum))
#+END_SRC
#+RESULTS:
: 3

******* 末尾呼び出しバージョンを使ってみる
この環境じゃ違いがわからないけど...
#+BEGIN_SRC elisp
  (my-length '(fie foh fum))
#+END_SRC

#+RESULTS:
: 3

*** もっと複雑なマクロ
冗長だった[[*my-length][my-length]]関数を，マクロを使って書き直す
my-lengthを再掲し，冗長なポイントにコメントをつけてみた．
#+BEGIN_SRC elisp
  (defun my-length (lst)
    (labels ((f (lst acc)                 ;ローカル関数を定義する
                (if lst                   ;リストが空かどうか調べる
                    (f (cdr lst) (1+ acc)) ;cdrでリストの残りを調べる
                  acc)))
      (f lst 0)))

  (my-length '(foo bar ping pong))
#+END_SRC

#+RESULTS:
: 4
マクロを使って，my-lengthを引き締めよう．
***** 描いてみる
#+BEGIN_SRC lisp
  (svg 100 100 (draw-die-svg 50 50 '(255 0 0)))
#+END_SRC

#+RESULTS:
: #\>
***** 描いてみる
#+BEGIN_SRC lisp
  (svg 300 300 (draw-tile-svg 0 0 0 '(0 3) 100 150 '(255 0 0) nil))
#+END_SRC

#+RESULTS:
: #\>
